@extends('admin::layouts.master')

{{-- page title --}}
@section('title')
    {{ $menu->currentName }}
@endsection


@section('content')
    <section class="content text-xs">

        <div class="row">
            <div class="col-12">
                <div class="card card-primary">
                    <div class="card-body">
                        <p>โปรโมชั่น แนะนำเพื่อน FASTSTART รหัส (pro_faststart) เมื่อใช้งาน Auto ระบบจะ
                            ตรวจสอบยอดเติมเงินของสมาชิก
                            และมอบโบนัสให้กับ Upline โดยอัตโนมัติ </p>
                        <p>โปรโมชั่น Cashback รหัส (pro_cashback) เมื่อใช้งาน Auto ระบบจะ
                            ตรวจสอบและดำเนินการมอบโบนัสให้ทุกวัน
                            หลังเที่ยงคืน ทำงานช่วงเวลา ไม่เกินตีสอง โดยค่าที่ตั้งคือ จ่ายเป็น % และ จำนวน % เท่านั้น
                            ระบุ เทรินและอัตราอั้นถอนได้ ในระบบ seamless</p>
                        <p>โปรโมชั่น ชวนเพื่อนมาเป็นหุ้นส่วน (pro_ic) เมื่อใช้งาน Auto ระบบจะ
                            ตรวจสอบและดำเนินการมอบโบนัสให้ทุกวัน หลังเที่ยงคืน ไม่เกินตีสอง โดยค่าที่ตั้งคือ จ่ายเป็น %
                            และ จำนวน % เท่านั้น ระบุ เทรินและอัตราอั้นถอนได้ ในระบบ seamless</p>
                        <p>ระบบ โปรโมชั่น เวอชั่นนี้ รองรับแค่ โปรพื้นฐานเท่านั้น โปรเพิ่มเติมที่ขอเพิ่มจากระบบเก่า
                            จะไม่สามารถใช้งานได้ หรือใช้งานได้แต่่ผิด ขอสงวนสิทธิ์ในการแก้ไข ให้ถูกต้อง</p>
                        <p>โปรโมชั่นระบบ พื้นฐาน มีรหัส ดังนี้ pro_newuser pro_faststart pro_firstday pro_cashback
                            pro_ic ห้ามตั้งเอง ห้ามมี หลายรายการโปร</p>
                        <p>โปรโมชั่นอื่นๆ ที่เป็นแค่เนื้อหา ไม่เกี่ยวข้องกับระบบ โปรดใส่ ที่ โปรโมชั่น เพิ่มเติม</p>
                        <p>รหัสโปร หมายถึง pro_newuser , pro_firstday และอื่นๆ </p>
                        <p>รายการโปร หมายถึง รายการที่ลูกค้า เพิ่มเข้ามาในระบบ อาจจะมีรหัสโปร เหมือนหรือต่างกัน ตามที่เลือก</p>
                        <p>โปร pro_firstday ครั้งแรกของวัน / รับได้ ถ้าไม่ได้รับโปรอื่นมาก่อน ในวันนั้น ถ้ามีหลายโปร เลือกรับได้ 1 รายการ </p>
                        <p>โปร pro_oneonly รุ่นเดียวกัน / รับได้ ถ้ามีหลายรายการโปร เลือกรับได้ 1 รายการ วันละครั้ง </p>
                        <p>โปร pro_oneonly_day วันละครั้ง / รับได้ ถ้ามีหลายรายการโปร ก็รับได้ทั้งหมด แต่ วันละครั้ง </p>
                        <p>โปร pro_oneonly_time โปรละครั้ง / รับได้ ถ้ามีหลายรายการโปร ก็รับได้ทั้งหมด แต่รับได้ ครั้งเดียวต่อรายการโปร  </p>

{{--                        <p class="text-danger">จำกัดยอดถอนได้ หมายถึง เราอยากเซตโปร ให้ติดเทิน xxx บาท เช่น โปร เติม 50--}}
{{--                            ได้ 100 เทิน 3 เท่า = ต้องได้ยอด 300 ในเกม ถึงจะถอนได้ แต่ตอนถอน ให้ 150 บาทพอ--}}
{{--                            ก็มาใส่ค่าที่ตรงนี้</p>--}}
{{--                        <p>จำกัดยอดถอนได้ ไม่มีผลในระบบ seamless</p>--}}
{{--                        <p class="text-danger">* จำกัดยอดถอนได้ ถ้าใส่จำนวนที่เยอะ เช่น 50,000 หมายถึงตอนโยกออกมา เขาจะได้ 50,000 นะคับ ไม่เข้าใจตรงนี้อย่าใส่ค่า</p>--}}
                    </div>
                </div>
                <!-- /.info-box -->
            </div>
        </div>

        <div class="card">

            <div class="card-body">
                @includeIf('admin::module.'.$menu->currentRoute.'.create')
                @include('admin::module.'.$menu->currentRoute.'.table')
                @includeIf('admin::module.'.$menu->currentRoute.'.addedit')
            </div>
            <!-- /.card-body -->
        </div>
    </section>

@endsection

